---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
LossFactor Properties
LossFactor Class See Also Send Feedback
---

The LossFactor type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | LossFactorValue | The calculated loss factor value |

# See Also

LossFactor Class

Autodesk.Revit.DB.Lighting Namespace